import java.util.Scanner;

/**
 Реализовать класс-счетчик.
 Полями класса должны выступать название счетчика и, непосредственно, целочисленный счетчик.

 *Реализовать для созданного класса конструктор с двумя параметрами,

 * с одним (значение счетчика в таком случае инициализировать как 0),методы увеличения и уменьшения счетчиков на
 1 и на заданное пользователем целом значение.
 Методы должны возвращать актуальное значение счетчика.

 Используя созданный класс, посчитать количество четных и количество нечетных чисел в ряду от 1 до 100.
 Конечные показатели счетчиков вывести в консоль.

 Пример вывода в консоли:
 Нечетные числа: 50
 Четные числа: 50*/

public class Lesson_8 {

/*      Scanner sc = new Scanner(System.in);
        System.out.println("Введите диапазон целых, положительных чисел!");
        System.out.print("Начало: ");
        int start = Integer.parseInt(sc.nextLine());
        System.out.print("Конец: ");
        int end = Integer.parseInt(sc.nextLine());
        sc.close();

        if ((end < start) || (end < 0) || (start < 0)){
                System.out.println("Ты чо, мудак?");
            }

        else {
                Counter countOdd = new Counter();
                Counter countEven = new Counter();
                int i = start;

                for (i = start; i <= end; i++){
                    if (i == 0){
                        i++;
                    }
                    if (i % 2 == 0){
                        countEven.increment();
                    }
                    else {
                        countOdd.increment();
                    }

                }
            System.out.println("Нечётных чисел: " + countOdd.count + "\nЧётных чисел: " + countEven.count);

            }
        }

            }*/
}



